# GroupOffsetFromLevel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GroupOffsetFromLevel Property
ParameterTypeId Class See Also
---
"Origin Level Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GroupOffsetFromLevel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GroupOffsetFromLevel As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GroupOffsetFromLevel {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace